#• Пакет химикали - 5.80 лв.
#• Пакет маркери - 7.20 лв.
#• Препарат - 1.20 лв (за литър)

#· Брой пакети химикали - цяло число в интервала [0...100]
pen_packs = int(input()) * 5.80
#· Брой пакети маркери - цяло число в интервала [0...100]
marker_packs = int(input()) * 7.20
#· Литри препарат за почистване на дъска - цяло число в интервала [0…50]
cleaning_liquid = int(input()) * 1.20
#· Процент намаление - цяло число в интервала [0...100]
discount_percentage = int(input())
#Да се отпечата на конзолата колко пари ще са нужни на Ани, за да си плати сметката.

print((pen_packs + marker_packs + cleaning_liquid) - (pen_packs + marker_packs + cleaning_liquid) * discount_percentage / 100)