#Предпазен найлон - 1.50 лв. за кв. метър
#· Боя - 14.50 лв. за литър
#· Разредител за боя - 5.00 лв. за литър

#1. Необходимо количество найлон (в кв.м.) - цяло число в интервала [1... 100]
#2. Необходимо количество боя (в литри) - цяло число в интервала [1…100]
#3. Количество разредител (в литри) - цяло число в интервала [1…30]
#4. Часовете, за които майсторите ще свършат работата - цяло число в интервала [1…9]
#Да се отпечата на конзолата един ред: "{сумата на всички разходи}"

nylon = int(input())
paint = int(input())
paint_thinner = int(input())
hours_of_work = int(input())

total_material_price = (nylon + 2) * 1.50 + (paint + paint * 10 / 100) * 14.50 + paint_thinner * 5.00 + 0.40
work_price_per_hour = total_material_price * 0.3

print(total_material_price + work_price_per_hour*hours_of_work)

