#• Пилешко меню – 10.35 лв.
#• Меню с риба – 12.40 лв.
#• Вегетарианско меню – 8.15 лв.
#Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
#Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката).
#Цената на доставка е 2.50 лв и се начислява най-накрая.

#Да се отпечата на конзолата един ред: "{цена на поръчката}"

chicken_menus = int(input())
fish_menus = int(input())
vegan_menus = int(input())

main_menu_sum = chicken_menus * 10.35 + fish_menus * 12.40 + vegan_menus * 8.15
dessert = main_menu_sum * 0.2
total_price = main_menu_sum + dessert + 2.50

print(total_price)