#Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета и котки.
# Храната се пазарува от зоомагазин, като една опаковка храна за кучета е на цена 2.50 лв, а опаковка храна
# за котки струва 4 лв.

#1. Броят на опаковките храна за кучета – цяло число в интервала [0… 100]
#2. Броят на опаковките храна за котки – цяло число в интервала [0… 100]

numbers_packs_dogs = float(input())
numbers_packs_cats = int(input())

price_dogs = 2.50
price_cats = 4

print(f'{numbers_packs_cats * price_cats + numbers_packs_dogs * price_dogs} lv.' )

